Revit 2027 API
BuiltInFailures.ZoneFailures.ZoneExistsNotEnclosedRoom Property
 Zone has a room not enclosed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ZoneExistsNotEnclosedRoom { get; }
Public Shared ReadOnly Property ZoneExistsNotEnclosedRoom As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ZoneExistsNotEnclosedRoom {
	FailureDefinitionId^ get ();
}
static member ZoneExistsNotEnclosedRoom : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ZoneFailures Class
Autodesk.Revit.DB Namespace